Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUIDataItems
Gets all UI data items stored in the UI data.
Returns:
An array of UI data items.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.GetUnits
Gets units.
Returns:
The Units object.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData
The input and output data used by external UI servers for storing UI settings.
Since:
2014